{
  "version": 3,
  "description": "**Descrizione del Progetto (v4):**\n\nIl progetto consiste nella realizzazione di un **NAS (Network Attached Storage) domestico** basato su server fisico a basso consumo energetico, con **approccio incrementale**: versione base leggera e funzionale, successivamente espandibile con features avanzate.\n\n**Capacità Storage**: **1-2 TB** con configurazione **RAID 1 (mirror)** per la ridondanza. Due dischi identici garantiscono che la rottura di un singolo disco (HD o SSD) non comporti perdita di dati. **Crittografia a livello disco** (es. LUKS) per protezione in caso di furto fisico, implementata se non impatta eccessivamente sulle performance.\n\n**Architettura Storage - Segmentazione**:\n- **Zona privata (LAN-only)**: accessibile esclusivamente dalla rete locale domestica (LAN/WiFi), contenente file personali e sensibili\n- **Zona pubblica (web-accessible)**: esposta su internet con **autenticazione tramite credenziali e passkey**, per condivisione e accesso remoto\n\n**Accesso Remoto**: il sistema supporta sia **accesso diretto tramite autenticazione** sia **VPN** per maggiore sicurezza. La VPN crea un tunnel criptato che rende il server accessibile come se si fosse sulla LAN domestica, aumentando la sicurezza e permettendo eventuale accesso futuro anche ai file della zona privata con credenziali privilegiate.\n\n**Stack Software**: **piattaforma Linux** con soluzioni **open-source, mantenute e sicure**. Candidati: TrueNAS SCALE, OpenMediaVault, o configurazioni custom (es. Nextcloud + Wireguard VPN). L'utente ha dimestichezza con Linux.\n\n**Utilizzo**: sistema **mono-utente** personale funzionante come **cloud storage privato multi-piattaforma**. Carico previsto: **2-3 dispositivi simultanei massimo**. Funzionalità principalmente upload/download con **preview rapida** dei documenti e capacità di editing leggero quando necessario.\n\n**Gestione Energetica**: server funzionante **on-demand con spegnimento automatico** dopo periodo di inattività per ottimizzare consumi elettrici. Sistema **Wake-on-LAN** per accensione remota rapida quando necessario (importante: deve riaccendersi velocemente).\n\n**Hardware**: budget molto contenuto, focus su rapporto qualità/prezzo ottimale. Requisiti: basso consumo, affidabilità, compatibilità Linux eccellente. Scelta hardware specifica da definire in fase di implementazione.\n\n**Backup Strategy**: protezione primaria tramite RAID 1. Per protezione secondaria contro cancellazioni accidentali, ransomware o disastri, possibile backup periodico su HD USB esterno economico. **Integrazione con cloud commerciali**: possibilità di scaricare/importare file da servizi cloud (Google Drive, Dropbox, ecc.) ma non sincronizzazione verso cloud esterni (obiettivo è indipendenza dai cloud commerciali).\n\n**Connettività**: linea Fastweb con IP dinamico. Possibile richiedere gratuitamente **IP pubblico statico** chiamando servizio clienti Fastweb (motivazione: accesso remoto/videosorveglianza). Alternativa: servizi DNS dinamici per IP dinamico.\n\n**Roadmap Features Avanzate** (da implementare successivamente):\n- **Ricerca semantica** dei file\n- **Sistema di versioning** stile git per file critici (tracking modifiche e versioni storiche)\n- **Sistema di notifiche** (email/push) per eventi critici (guasti disco, spazio esaurito, accessi anomali)\n- **Integrazione automazioni smart home**\n- **Accesso multi-utente** con permessi differenziati\n\n**Filosofia Progetto**: partire con versione base **minimalista, leggera e stabile**, evitando over-engineering. Espansione graduale delle funzionalità man mano che si acquisisce esperienza con il sistema e si dispone di budget per hardware più performante.",
  "last_updated": "2025-10-28T13:04:14.565096Z",
  "iteration": 3
}